<?php

use Illuminate\Database\Seeder;
use App\Cat;

class CatsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //['护肤','底妆','彩妆','美发','香水','日常护理']

        $records=['id','name','similar_name'];
        $datas = [
            [1,'卸妆','卸妆油，卸妆液，卸妆乳，卸妆膏，卸妆啫喱，眼唇卸妆，卸妆湿巾'],
            [2,'洁面','洗面奶，洁面皂，洁面粉，T区护理'],
            [3,'化妆水','爽肤水，洁肤水，喷雾化妆水，导入液'],
            [4,'乳液面霜','日霜，晚霜，精华面霜，全能护肤品'],
            [5,'精华','美容液，肌底液，精华油，安瓶，VC粉'],
            [6,'防晒','防晒霜，防晒喷雾，防晒乳'],
            [7,'面膜','清洁面膜，片状面膜，水洗式面膜，睡眠面膜，冻膜'],
            [8,'眼唇护理','眼霜，眼膜，眼罩，润唇膏，护唇膏，唇膜，睫毛增长液'],
            [9,'美肌食品','美白丸，酵素，胶原蛋白，玻尿酸，健康食品'],
            [10,'美容工具','洁面仪，蒸脸器，美容仪，卸妆棉，化妆棉，吸油纸'],
            [21,'妆前','隔离乳，隔离霜，妆前乳，妆前霜'],
            [22,'粉底','粉底液，粉饼，粉底霜，气垫，BB霜，CC霜，素颜霜'],
            [23,'遮瑕','遮瑕笔，遮瑕霜，遮瑕膏'],
            [24,'定妆','散粉，蜜粉，蜜粉饼，定妆粉，定妆喷雾'],
            [25,'底妆工具','美妆蛋，粉底刷，粉扑，粉扑清洁剂'],
            [41,'眼线','眼线笔，眼线液，眼线膏，眼线胶'],
            [42,'眼影','眼影膏，眼影打底，眼影盘'],
            [43,'睫毛膏','睫毛打底，睫毛雨衣'],
            [44,'眉妆','眉笔，眉粉，染眉膏，眉胶，眉毛雨衣'],
            [45,'口红','唇膏，唇彩，唇釉，唇笔，唇露，染唇液，唇部打底'],
            [46,'腮红修容','颊彩，修容，高光，阴影，腮红膏，唇颊两用'],
            [47,'美甲','指甲油，护甲油，指甲贴，卸甲油，洗甲水'],
            [48,'局部工具','睫毛夹，假睫毛，假睫毛胶水，双眼皮贴，修眉刀，化妆刷，化妆包，刷具清洁剂'],
            [61,'洗发护发','洗发水，护发素，发膜，免洗护发素，护发油'],
            [62,'染发','染发膏，漂发剂，固色剂'],
            [63,'造型','弹力素，发胶，定型喷雾，摩斯，头发香水，蓬蓬粉，干发剂'],
            [64,'美发工具','梳子，发夹，卷发棒，直发棒，吹风机，去屑按摩仪，丸子头'],
            [81,'香水','男士香水，女士香水'],
            [101,'身体护理','护手霜，除汗剂，脱毛膏，美颈，美胸，口腔护理，足部护理，身体乳，磨砂膏，按摩乳，沐浴露'],
            [102,'生理私处','卫生巾，卫生棉条，卫生裤，护垫，月经杯，私处护理'],
            [103,'隐形眼镜','美瞳，眼药水，洗眼液，隐形眼镜护理液'],
            [104,'机能穿着','机能文胸，瘦腿袜，防晒衣物'],
        ];

        $cats=[];
        foreach ($datas as $data){
            $cats[]=array_combine($records,$data);
        }
        DB::table('cats')->insert($cats);
    }
}
